-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/chaseabram/UChiGit/Dingel Fall 2020/Assignment 2/Stata_est_2.log
  log type:  text
 opened on:  25 Oct 2020, 22:11:11

. 
. * Setup
. clear all

. set maxvar 32000


. 
. * Load data
. use col_regfile09

. * Only keep what we will use
. keep flow distw iso_o year iso_d contig comlang_off

. keep if year >= 2004 & year <= 2006
(1,112,985 observations deleted)

. 
. 
. * Log the data and 1+data
. gen logflow = log(flow)
(24,303 missing values generated)

. gen logdist = log(distw)

. gen logflow_1 = log(flow + 1)

. 
. * Make dummies
. egen year_iso_o = group(year iso_o)

. egen year_iso_d = group(year iso_d)

. 
. * label variables for table
. label var contig "Contiguous countries (binary)"

. label var comlang_off "Common language (binary)"

. label var logdist "log(Distance)"

. label var logflow "log(Flows)"

. label var logflow_1 "log(1+Flows)"

. 
. * Clear estimate storage and timer
. eststo clear

. timer clear

. 
. * Table 2
. 
. * 1. A log-linear regression that omits observations in which flow equals zero.
. timer on 1

. eststo: quietly reghdfe logflow logdist contig comlang_off if (flow > 0), a(year_iso_o year_iso_d) resid
(est1 stored)

. predict fitted
(option xb assumed; fitted values)

. predict resid, resid
(24,336 missing values generated)

. timer off 1

. timer list 1
   1:      1.63 /        1 =       1.6300

. estadd local time = r(t1), replace

added macro:
               e(time) : "1.63"

. estadd local zeros "No"

added macro:
              e(zeros) : "No"

. estadd local log_plus "No"

added macro:
           e(log_plus) : "No"

. estadd local regtype "Log-Linear"

added macro:
            e(regtype) : "Log-Linear"

. 
. * 2. A log-linear regression that omits observations in which flow equals zero. In addition, set the dependent variable to log of
>  flow plus one.
. timer on 2

. eststo: quietly reghdfe logflow_1 logdist contig comlang_off if (flow > 0), a(year_iso_o year_iso_d)
(est2 stored)

. timer off 2

. timer list 2
   2:      0.96 /        1 =       0.9630

. estadd loca time = r(t2), replace

added macro:
               e(time) : ".963"

. estadd local zeros "No"

added macro:
              e(zeros) : "No"

. estadd local log_plus "Yes"

added macro:
           e(log_plus) : "Yes"

. estadd local regtype "Log-Linear"

added macro:
            e(regtype) : "Log-Linear"

. 
. * 3. A log-linear regression in which the dependent variable is log of flow plus one.
. timer on 3

. eststo: quietly reghdfe logflow_1 logdist contig comlang_off, a(year_iso_o year_iso_d)
(est3 stored)

. timer off 3

. timer list 3
   3:      0.83 /        1 =       0.8280

. estadd loca time = r(t3), replace

added macro:
               e(time) : ".8280000000000001"

. estadd local zeros "Yes"

added macro:
              e(zeros) : "Yes"

. estadd local log_plus "Yes"

added macro:
           e(log_plus) : "Yes"

. estadd local regtype "Log-Linear"

added macro:
            e(regtype) : "Log-Linear"

. 
. * 4. An estimate of the same constant-elasticity specification that uses the ppml command to implement the PPML estimator of Silv
> a and Tenreyro (REStat 2006). Use all observations, including zeros, in this and following three columns.
. timer on 4

. qui tab year_iso_o, gen(yo_)

. qui tab year_iso_d, gen(yd_)

. eststo: ppml flow logdist contig comlang_off yo_* yd_* if (year >= 2004 & year <= 2006)

note: checking the existence of the estimates

Number of regressors excluded to ensure that the estimates exist: 1
Excluded regressors:  yo_266
Number of observations excluded: 1

note: yo_207 omitted because of collinearity
note: yo_584 omitted because of collinearity
note: yd_180 omitted because of collinearity
note: yd_208 omitted because of collinearity

note: starting ppml estimation
note: flow has noninteger values

Iteration 1:   deviance =  4.00e+07
Iteration 2:   deviance =  2.13e+07
Iteration 3:   deviance =  1.60e+07
Iteration 4:   deviance =  1.47e+07
Iteration 5:   deviance =  1.45e+07
Iteration 6:   deviance =  1.44e+07
Iteration 7:   deviance =  1.44e+07
Iteration 8:   deviance =  1.44e+07
Iteration 9:   deviance =  1.44e+07
Iteration 10:  deviance =  1.44e+07
Iteration 11:  deviance =  1.44e+07
Iteration 12:  deviance =  1.44e+07
Iteration 13:  deviance =  1.44e+07
Iteration 14:  deviance =  1.44e+07
Iteration 15:  deviance =  1.44e+07
Iteration 16:  deviance =  1.44e+07
Warning:  variance matrix is nonsymmetric or highly singular

Number of parameters: 1215
Number of observations: 91685
Pseudo log-likelihood: -7317860.3
R-squared: .90669293
Option strict is: off
------------------------------------------------------------------------------
             |               Robust
        flow |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     logdist |   -.898961          .        .       .            .           .
      contig |   .4620754          .        .       .            .           .
 comlang_off |   .2123272          .        .       .            .           .
        yo_1 |   8.990397          .        .       .            .           .
        yo_2 |   6.478043          .        .       .            .           .
        yo_3 |    11.0218          .        .       .            .           .
        yo_4 |   7.282465          .        .       .            .           .
        yo_5 |  -.2654397          .        .       .            .           .
        yo_6 |   8.882711          .        .       .            .           .
        yo_7 |   12.25427          .        .       .            .           .
        yo_8 |   12.18921          .        .       .            .           .
        yo_9 |   7.717955          .        .       .            .           .
       yo_10 |   6.610723          .        .       .            .           .
       yo_11 |   13.25041          .        .       .            .           .
       yo_12 |   11.99196          .        .       .            .           .
       yo_13 |   9.496906          .        .       .            .           .
       yo_14 |   5.666387          .        .       .            .           .
       yo_15 |   12.61123          .        .       .            .           .
       yo_16 |   7.355228          .        .       .            .           .
       yo_17 |   7.296117          .        .       .            .           .
       yo_18 |   10.37148          .        .       .            .           .
       yo_19 |   10.00657          .        .       .            .           .
       yo_20 |   9.504434          .        .       .            .           .
       yo_21 |    8.25989          .        .       .            .           .
       yo_22 |   8.045656          .        .       .            .           .
       yo_23 |   10.38605          .        .       .            .           .
       yo_24 |   6.640737          .        .       .            .           .
       yo_25 |   8.250225          .        .       .            .           .
       yo_26 |   9.307421          .        .       .            .           .
       yo_27 |   13.26425          .        .       .            .           .
       yo_28 |   6.956903          .        .       .            .           .
       yo_29 |   9.745774          .        .       .            .           .
       yo_30 |   5.513441          .        .       .            .           .
       yo_31 |   9.524935          .        .       .            .           .
       yo_32 |   6.369502          .        .       .            .           .
       yo_33 |   13.30359          .        .       .            .           .
       yo_34 |    11.9795          .        .       .            .           .
       yo_35 |   12.14709          .        .       .            .           .
       yo_36 |   14.76316          .        .       .            .           .
       yo_37 |   10.34177          .        .       .            .           .
       yo_38 |   9.503811          .        .       .            .           .
       yo_39 |   9.812557          .        .       .            .           .
       yo_40 |   11.11893          .        .       .            .           .
       yo_41 |    5.22772          .        .       .            .           .
       yo_42 |   4.473809          .        .       .            .           .
       yo_43 |   10.54957          .        .       .            .           .
       yo_44 |    8.80682          .        .       .            .           .
       yo_45 |   8.444806          .        .       .            .           .
       yo_46 |   11.50113          .        .       .            .           .
       yo_47 |   14.17228          .        .       .            .           .
       yo_48 |   6.980368          .        .       .            .           .
       yo_49 |   5.425228          .        .       .            .           .
       yo_50 |   11.74024          .        .       .            .           .
       yo_51 |   9.787231          .        .       .            .           .
       yo_52 |   11.23633          .        .       .            .           .
       yo_53 |   10.65538          .        .       .            .           .
       yo_54 |   10.36661          .        .       .            .           .
       yo_55 |   3.681262          .        .       .            .           .
       yo_56 |   12.96496          .        .       .            .           .
       yo_57 |   9.718546          .        .       .            .           .
       yo_58 |    7.82118          .        .       .            .           .
       yo_59 |    11.9312          .        .       .            .           .
       yo_60 |   8.323429          .        .       .            .           .
       yo_61 |   6.799831          .        .       .            .           .
       yo_62 |   13.45488          .        .       .            .           .
       yo_63 |   7.231836          .        .       .            .           .
       yo_64 |   9.834447          .        .       .            .           .
       yo_65 |   13.38129          .        .       .            .           .
       yo_66 |   8.179087          .        .       .            .           .
       yo_67 |   9.007234          .        .       .            .           .
       yo_68 |   6.368947          .        .       .            .           .
       yo_69 |   8.459886          .        .       .            .           .
       yo_70 |   4.978826          .        .       .            .           .
       yo_71 |   6.174919          .        .       .            .           .
       yo_72 |   9.838743          .        .       .            .           .
       yo_73 |   10.57889          .        .       .            .           .
       yo_74 |   4.869603          .        .       .            .           .
       yo_75 |   7.350899          .        .       .            .           .
       yo_76 |   9.745049          .        .       .            .           .
       yo_77 |   7.778354          .        .       .            .           .
       yo_78 |   13.50173          .        .       .            .           .
       yo_79 |    9.56045          .        .       .            .           .
       yo_80 |   9.542548          .        .       .            .           .
       yo_81 |   7.243469          .        .       .            .           .
       yo_82 |   11.55508          .        .       .            .           .
       yo_83 |   12.86242          .        .       .            .           .
       yo_84 |   12.66482          .        .       .            .           .
       yo_85 |   12.20674          .        .       .            .           .
       yo_86 |   11.68247          .        .       .            .           .
       yo_87 |   10.77621          .        .       .            .           .
       yo_88 |   9.168156          .        .       .            .           .
       yo_89 |   11.60682          .        .       .            .           .
       yo_90 |   13.49081          .        .       .            .           .
       yo_91 |     8.5949          .        .       .            .           .
       yo_92 |   9.166259          .        .       .            .           .
       yo_93 |   14.69248          .        .       .            .           .
       yo_94 |   11.33794          .        .       .            .           .
       yo_95 |   9.575806          .        .       .            .           .
       yo_96 |   7.965707          .        .       .            .           .
       yo_97 |   9.041908          .        .       .            .           .
       yo_98 |    4.54184          .        .       .            .           .
       yo_99 |   5.510205          .        .       .            .           .
      yo_100 |   13.56718          .        .       .            .           .
      yo_101 |   11.33039          .        .       .            .           .
      yo_102 |   7.034427          .        .       .            .           .
      yo_103 |   8.559953          .        .       .            .           .
      yo_104 |   8.279245          .        .       .            .           .
      yo_105 |   10.91092          .        .       .            .           .
      yo_106 |   5.663688          .        .       .            .           .
      yo_107 |   10.18956          .        .       .            .           .
      yo_108 |   7.737961          .        .       .            .           .
      yo_109 |   9.914957          .        .       .            .           .
      yo_110 |   9.512454          .        .       .            .           .
      yo_111 |   9.382982          .        .       .            .           .
      yo_112 |   8.575936          .        .       .            .           .
      yo_113 |   10.36462          .        .       .            .           .
      yo_114 |    8.07375          .        .       .            .           .
      yo_115 |   8.828018          .        .       .            .           .
      yo_116 |   8.561805          .        .       .            .           .
      yo_117 |   13.10657          .        .       .            .           .
      yo_118 |   3.208923          .        .       .            .           .
      yo_119 |   8.276182          .        .       .            .           .
      yo_120 |   7.170312          .        .       .            .           .
      yo_121 |   8.939392          .        .       .            .           .
      yo_122 |    9.14609          .        .       .            .           .
      yo_123 |    8.03997          .        .       .            .           .
      yo_124 |   9.444696          .        .       .            .           .
      yo_125 |   8.039742          .        .       .            .           .
      yo_126 |   9.257092          .        .       .            .           .
      yo_127 |   7.810394          .        .       .            .           .
      yo_128 |   13.05099          .        .       .            .           .
      yo_129 |   8.842905          .        .       .            .           .
      yo_130 |   8.652068          .        .       .            .           .
      yo_131 |   7.217597          .        .       .            .           .
      yo_132 |   11.79067          .        .       .            .           .
      yo_133 |   8.462272          .        .       .            .           .
      yo_134 |   12.97411          .        .       .            .           .
      yo_135 |   12.17295          .        .       .            .           .
      yo_136 |   7.865778          .        .       .            .           .
      yo_137 |   4.515738          .        .       .            .           .
      yo_138 |   11.73579          .        .       .            .           .
      yo_139 |   10.64399          .        .       .            .           .
      yo_140 |   10.73111          .        .       .            .           .
      yo_141 |   9.422261          .        .       .            .           .
      yo_142 |   11.00243          .        .       .            .           .
      yo_143 |   12.14302          .        .       .            .           .
      yo_144 |   4.580938          .        .       .            .           .
      yo_145 |   9.432913          .        .       .            .           .
      yo_146 |    11.7632          .        .       .            .           .
      yo_147 |   7.831622          .        .       .            .           .
      yo_148 |   11.44406          .        .       .            .           .
      yo_149 |   9.281132          .        .       .            .           .
      yo_150 |   7.829601          .        .       .            .           .
      yo_151 |   10.96298          .        .       .            .           .
      yo_152 |   10.93495          .        .       .            .           .
      yo_153 |   13.37367          .        .       .            .           .
      yo_154 |   7.262088          .        .       .            .           .
      yo_155 |   12.90275          .        .       .            .           .
      yo_156 |    9.87117          .        .       .            .           .
      yo_157 |   8.464796          .        .       .            .           .
      yo_158 |    13.4177          .        .       .            .           .
      yo_159 |   4.745747          .        .       .            .           .
      yo_160 |   6.807088          .        .       .            .           .
      yo_161 |   6.571391          .        .       .            .           .
      yo_162 |   9.301287          .        .       .            .           .
      yo_163 |  -.2908819          .        .       .            .           .
      yo_164 |   6.718725          .        .       .            .           .
      yo_165 |   3.109916          .        .       .            .           .
      yo_166 |   3.881429          .        .       .            .           .
      yo_167 |   8.241421          .        .       .            .           .
      yo_168 |   10.64565          .        .       .            .           .
      yo_169 |   10.02507          .        .       .            .           .
      yo_170 |   12.49715          .        .       .            .           .
      yo_171 |   8.090649          .        .       .            .           .
      yo_172 |   7.462436          .        .       .            .           .
      yo_173 |   11.09555          .        .       .            .           .
      yo_174 |   8.458187          .        .       .            .           .
      yo_175 |   7.670024          .        .       .            .           .
      yo_176 |   12.87575          .        .       .            .           .
      yo_177 |    8.39703          .        .       .            .           .
      yo_178 |   9.585983          .        .       .            .           .
      yo_179 |   2.747131          .        .       .            .           .
      yo_180 |   5.278911          .        .       .            .           .
      yo_181 |   10.30324          .        .       .            .           .
      yo_182 |   10.05802          .        .       .            .           .
      yo_183 |   12.08518          .        .       .            .           .
      yo_184 |   2.028554          .        .       .            .           .
      yo_185 |   13.18901          .        .       .            .           .
      yo_186 |   8.564957          .        .       .            .           .
      yo_187 |   7.730005          .        .       .            .           .
      yo_188 |   11.41851          .        .       .            .           .
      yo_189 |   9.740333          .        .       .            .           .
      yo_190 |   15.31495          .        .       .            .           .
      yo_191 |   9.259673          .        .       .            .           .
      yo_192 |   7.007817          .        .       .            .           .
      yo_193 |   11.99231          .        .       .            .           .
      yo_194 |   11.40936          .        .       .            .           .
      yo_195 |   7.039495          .        .       .            .           .
      yo_196 |   6.145157          .        .       .            .           .
      yo_197 |   9.834341          .        .       .            .           .
      yo_198 |    8.58994          .        .       .            .           .
      yo_199 |   12.53352          .        .       .            .           .
      yo_200 |   8.615378          .        .       .            .           .
      yo_201 |   9.322316          .        .       .            .           .
      yo_202 |   9.238653          .        .       .            .           .
      yo_203 |   11.21643          .        .       .            .           .
      yo_204 |   8.477381          .        .       .            .           .
      yo_205 |   13.32195          .        .       .            .           .
      yo_206 |   9.130852          .        .       .            .           .
      yo_208 |   11.00816          .        .       .            .           .
      yo_209 |   14.33752          .        .       .            .           .
      yo_210 |   14.04964          .        .       .            .           .
      yo_211 |    9.81174          .        .       .            .           .
      yo_212 |    8.14844          .        .       .            .           .
      yo_213 |   15.19302          .        .       .            .           .
      yo_214 |   13.80712          .        .       .            .           .
      yo_215 |   11.50293          .        .       .            .           .
      yo_216 |    7.97769          .        .       .            .           .
      yo_217 |   14.45564          .        .       .            .           .
      yo_218 |   9.168195          .        .       .            .           .
      yo_219 |   9.040274          .        .       .            .           .
      yo_220 |   12.17131          .        .       .            .           .
      yo_221 |    11.9124          .        .       .            .           .
      yo_222 |   11.47209          .        .       .            .           .
      yo_223 |   10.40394          .        .       .            .           .
      yo_224 |   10.19124          .        .       .            .           .
      yo_225 |   12.28799          .        .       .            .           .
      yo_226 |   8.412824          .        .       .            .           .
      yo_227 |   10.17481          .        .       .            .           .
      yo_228 |   11.00059          .        .       .            .           .
      yo_229 |   15.20244          .        .       .            .           .
      yo_230 |   9.376734          .        .       .            .           .
      yo_231 |   11.72239          .        .       .            .           .
      yo_232 |   7.786078          .        .       .            .           .
      yo_233 |   11.35743          .        .       .            .           .
      yo_234 |   8.001398          .        .       .            .           .
      yo_235 |   15.19111          .        .       .            .           .
      yo_236 |   13.83965          .        .       .            .           .
      yo_237 |   14.10137          .        .       .            .           .
      yo_238 |    16.7447          .        .       .            .           .
      yo_239 |   12.18539          .        .       .            .           .
      yo_240 |   11.29365          .        .       .            .           .
      yo_241 |   11.91046          .        .       .            .           .
      yo_242 |    13.0877          .        .       .            .           .
      yo_243 |    6.61309          .        .       .            .           .
      yo_244 |   6.455284          .        .       .            .           .
      yo_245 |   12.39302          .        .       .            .           .
      yo_246 |   10.53959          .        .       .            .           .
      yo_247 |   10.35399          .        .       .            .           .
      yo_248 |   13.41583          .        .       .            .           .
      yo_249 |   15.99913          .        .       .            .           .
      yo_250 |   8.811729          .        .       .            .           .
      yo_251 |   7.389178          .        .       .            .           .
      yo_252 |   13.61442          .        .       .            .           .
      yo_253 |    11.5698          .        .       .            .           .
      yo_254 |   13.30952          .        .       .            .           .
      yo_255 |    12.5748          .        .       .            .           .
      yo_256 |   12.38686          .        .       .            .           .
      yo_257 |   5.832437          .        .       .            .           .
      yo_258 |   14.76858          .        .       .            .           .
      yo_259 |   11.65828          .        .       .            .           .
      yo_260 |   9.958042          .        .       .            .           .
      yo_261 |   13.79259          .        .       .            .           .
      yo_262 |   10.02787          .        .       .            .           .
      yo_263 |   8.708042          .        .       .            .           .
      yo_264 |   15.24761          .        .       .            .           .
      yo_265 |   9.015253          .        .       .            .           .
      yo_267 |    11.7124          .        .       .            .           .
      yo_268 |   15.23526          .        .       .            .           .
      yo_269 |   10.03597          .        .       .            .           .
      yo_270 |   10.78133          .        .       .            .           .
      yo_271 |   8.266201          .        .       .            .           .
      yo_272 |   10.23239          .        .       .            .           .
      yo_273 |   6.425908          .        .       .            .           .
      yo_274 |   7.919449          .        .       .            .           .
      yo_275 |   12.04408          .        .       .            .           .
      yo_276 |   12.43263          .        .       .            .           .
      yo_277 |   6.802709          .        .       .            .           .
      yo_278 |   9.165149          .        .       .            .           .
      yo_279 |   11.57294          .        .       .            .           .
      yo_280 |   9.515865          .        .       .            .           .
      yo_281 |   15.35884          .        .       .            .           .
      yo_282 |    11.3753          .        .       .            .           .
      yo_283 |   11.40447          .        .       .            .           .
      yo_284 |   9.185016          .        .       .            .           .
      yo_285 |   13.42888          .        .       .            .           .
      yo_286 |   14.74319          .        .       .            .           .
      yo_287 |   14.62459          .        .       .            .           .
      yo_288 |   14.05283          .        .       .            .           .
      yo_289 |   13.72756          .        .       .            .           .
      yo_290 |   12.62719          .        .       .            .           .
      yo_291 |   10.95333          .        .       .            .           .
      yo_292 |   13.47223          .        .       .            .           .
      yo_293 |   15.30619          .        .       .            .           .
      yo_294 |   10.45467          .        .       .            .           .
      yo_295 |   11.04617          .        .       .            .           .
      yo_296 |   16.49626          .        .       .            .           .
      yo_297 |   12.96465          .        .       .            .           .
      yo_298 |   11.36527          .        .       .            .           .
      yo_299 |   9.572734          .        .       .            .           .
      yo_300 |   11.05056          .        .       .            .           .
      yo_301 |   5.040512          .        .       .            .           .
      yo_302 |   7.434653          .        .       .            .           .
      yo_303 |   15.43452          .        .       .            .           .
      yo_304 |   13.39869          .        .       .            .           .
      yo_305 |   9.093927          .        .       .            .           .
      yo_306 |   10.46438          .        .       .            .           .
      yo_307 |   10.06968          .        .       .            .           .
      yo_308 |   13.08301          .        .       .            .           .
      yo_309 |   8.102371          .        .       .            .           .
      yo_310 |   12.02062          .        .       .            .           .
      yo_311 |   9.424097          .        .       .            .           .
      yo_312 |    11.9011          .        .       .            .           .
      yo_313 |   11.23313          .        .       .            .           .
      yo_314 |   11.33197          .        .       .            .           .
      yo_315 |   10.32536          .        .       .            .           .
      yo_316 |   12.34497          .        .       .            .           .
      yo_317 |    9.87069          .        .       .            .           .
      yo_318 |   10.35187          .        .       .            .           .
      yo_319 |   8.360633          .        .       .            .           .
      yo_320 |    14.9929          .        .       .            .           .
      yo_321 |   3.549407          .        .       .            .           .
      yo_322 |   10.20654          .        .       .            .           .
      yo_323 |   8.621613          .        .       .            .           .
      yo_324 |   10.63214          .        .       .            .           .
      yo_325 |   11.05687          .        .       .            .           .
      yo_326 |   9.889059          .        .       .            .           .
      yo_327 |   11.36703          .        .       .            .           .
      yo_328 |   9.955514          .        .       .            .           .
      yo_329 |   11.05524          .        .       .            .           .
      yo_330 |   9.777603          .        .       .            .           .
      yo_331 |   14.90027          .        .       .            .           .
      yo_332 |     10.659          .        .       .            .           .
      yo_333 |   10.36093          .        .       .            .           .
      yo_334 |   8.808701          .        .       .            .           .
      yo_335 |   13.81069          .        .       .            .           .
      yo_336 |   10.45255          .        .       .            .           .
      yo_337 |   14.86938          .        .       .            .           .
      yo_338 |    14.1683          .        .       .            .           .
      yo_339 |   9.708216          .        .       .            .           .
      yo_340 |   4.958025          .        .       .            .           .
      yo_341 |   13.56018          .        .       .            .           .
      yo_342 |   12.68006          .        .       .            .           .
      yo_343 |    12.6517          .        .       .            .           .
      yo_344 |   11.39957          .        .       .            .           .
      yo_345 |   13.06657          .        .       .            .           .
      yo_346 |   13.99383          .        .       .            .           .
      yo_347 |   6.919272          .        .       .            .           .
      yo_348 |    11.4334          .        .       .            .           .
      yo_349 |   13.71207          .        .       .            .           .
      yo_350 |   9.646272          .        .       .            .           .
      yo_351 |   13.19331          .        .       .            .           .
      yo_352 |   11.02116          .        .       .            .           .
      yo_353 |   9.731013          .        .       .            .           .
      yo_354 |   12.95862          .        .       .            .           .
      yo_355 |   12.83414          .        .       .            .           .
      yo_356 |   15.40726          .        .       .            .           .
      yo_357 |   7.687488          .        .       .            .           .
      yo_358 |   14.98461          .        .       .            .           .
      yo_359 |   11.84981          .        .       .            .           .
      yo_360 |   10.53177          .        .       .            .           .
      yo_361 |   15.32597          .        .       .            .           .
      yo_362 |   6.483971          .        .       .            .           .
      yo_363 |     8.6942          .        .       .            .           .
      yo_364 |   8.386915          .        .       .            .           .
      yo_365 |   11.09725          .        .       .            .           .
      yo_366 |   1.949458          .        .       .            .           .
      yo_367 |   8.739172          .        .       .            .           .
      yo_368 |   5.277951          .        .       .            .           .
      yo_369 |   6.271381          .        .       .            .           .
      yo_370 |   10.06733          .        .       .            .           .
      yo_371 |   12.65529          .        .       .            .           .
      yo_372 |   12.04468          .        .       .            .           .
      yo_373 |   14.31459          .        .       .            .           .
      yo_374 |   9.982033          .        .       .            .           .
      yo_375 |   9.322828          .        .       .            .           .
      yo_376 |   11.97899          .        .       .            .           .
      yo_377 |   10.71669          .        .       .            .           .
      yo_378 |   9.501503          .        .       .            .           .
      yo_379 |   14.76566          .        .       .            .           .
      yo_380 |   10.25807          .        .       .            .           .
      yo_381 |   11.67871          .        .       .            .           .
      yo_382 |   5.557519          .        .       .            .           .
      yo_383 |   6.462055          .        .       .            .           .
      yo_384 |   12.32856          .        .       .            .           .
      yo_385 |   11.89311          .        .       .            .           .
      yo_386 |   13.96548          .        .       .            .           .
      yo_387 |   4.579386          .        .       .            .           .
      yo_388 |   15.02306          .        .       .            .           .
      yo_389 |   10.50367          .        .       .            .           .
      yo_390 |   9.645715          .        .       .            .           .
      yo_391 |   13.17342          .        .       .            .           .
      yo_392 |   11.62537          .        .       .            .           .
      yo_393 |   17.14481          .        .       .            .           .
      yo_394 |   11.25536          .        .       .            .           .
      yo_395 |   8.827225          .        .       .            .           .
      yo_396 |   14.01864          .        .       .            .           .
      yo_397 |   13.32063          .        .       .            .           .
      yo_398 |   8.909159          .        .       .            .           .
      yo_399 |   8.835811          .        .       .            .           .
      yo_400 |   12.11564          .        .       .            .           .
      yo_401 |    10.1316          .        .       .            .           .
      yo_402 |   14.41878          .        .       .            .           .
      yo_403 |   10.60457          .        .       .            .           .
      yo_404 |   11.45327          .        .       .            .           .
      yo_405 |   10.89269          .        .       .            .           .
      yo_406 |   10.84986          .        .       .            .           .
      yo_407 |   8.284763          .        .       .            .           .
      yo_408 |   13.35524          .        .       .            .           .
      yo_409 |   8.757293          .        .       .            .           .
      yo_410 |   3.017177          .        .       .            .           .
      yo_411 |   10.92715          .        .       .            .           .
      yo_412 |    14.1791          .        .       .            .           .
      yo_413 |    13.8323          .        .       .            .           .
      yo_414 |   9.104433          .        .       .            .           .
      yo_415 |   8.541793          .        .       .            .           .
      yo_416 |   15.01278          .        .       .            .           .
      yo_417 |   13.56878          .        .       .            .           .
      yo_418 |   11.76265          .        .       .            .           .
      yo_419 |   7.357748          .        .       .            .           .
      yo_420 |    14.2196          .        .       .            .           .
      yo_421 |   8.938934          .        .       .            .           .
      yo_422 |   8.827097          .        .       .            .           .
      yo_423 |   12.05493          .        .       .            .           .
      yo_424 |   11.79497          .        .       .            .           .
      yo_425 |   11.37994          .        .       .            .           .
      yo_426 |   10.07875          .        .       .            .           .
      yo_427 |    10.0619          .        .       .            .           .
      yo_428 |   12.14729          .        .       .            .           .
      yo_429 |   8.406959          .        .       .            .           .
      yo_430 |   8.889145          .        .       .            .           .
      yo_431 |   11.01754          .        .       .            .           .
      yo_432 |   15.01012          .        .       .            .           .
      yo_433 |   8.567665          .        .       .            .           .
      yo_434 |   11.58224          .        .       .            .           .
      yo_435 |   7.925052          .        .       .            .           .
      yo_436 |   11.14377          .        .       .            .           .
      yo_437 |   7.654679          .        .       .            .           .
      yo_438 |   14.94115          .        .       .            .           .
      yo_439 |   13.57908          .        .       .            .           .
      yo_440 |   14.12055          .        .       .            .           .
      yo_441 |   16.62759          .        .       .            .           .
      yo_442 |   11.92201          .        .       .            .           .
      yo_443 |    11.2212          .        .       .            .           .
      yo_444 |   11.97511          .        .       .            .           .
      yo_445 |   12.82553          .        .       .            .           .
      yo_446 |   6.581065          .        .       .            .           .
      yo_447 |   6.609746          .        .       .            .           .
      yo_448 |   12.16662          .        .       .            .           .
      yo_449 |   10.39069          .        .       .            .           .
      yo_450 |   10.58008          .        .       .            .           .
      yo_451 |   13.27346          .        .       .            .           .
      yo_452 |   15.79209          .        .       .            .           .
      yo_453 |   8.703089          .        .       .            .           .
      yo_454 |   7.154139          .        .       .            .           .
      yo_455 |   13.37273          .        .       .            .           .
      yo_456 |   11.31003          .        .       .            .           .
      yo_457 |   13.19359          .        .       .            .           .
      yo_458 |   12.35792          .        .       .            .           .
      yo_459 |   12.35132          .        .       .            .           .
      yo_460 |   5.363321          .        .       .            .           .
      yo_461 |   14.54539          .        .       .            .           .
      yo_462 |   11.53298          .        .       .            .           .
      yo_463 |   9.723475          .        .       .            .           .
      yo_464 |   13.57248          .        .       .            .           .
      yo_465 |   9.753831          .        .       .            .           .
      yo_466 |   8.300357          .        .       .            .           .
      yo_467 |   14.99457          .        .       .            .           .
      yo_468 |   8.839264          .        .       .            .           .
      yo_469 |   11.25415          .        .       .            .           .
      yo_470 |   15.01583          .        .       .            .           .
      yo_471 |   10.11066          .        .       .            .           .
      yo_472 |   10.63334          .        .       .            .           .
      yo_473 |   7.745802          .        .       .            .           .
      yo_474 |   9.901121          .        .       .            .           .
      yo_475 |   6.376635          .        .       .            .           .
      yo_476 |   7.799707          .        .       .            .           .
      yo_477 |   11.90374          .        .       .            .           .
      yo_478 |   12.27523          .        .       .            .           .
      yo_479 |   6.239407          .        .       .            .           .
      yo_480 |   8.767778          .        .       .            .           .
      yo_481 |   11.31984          .        .       .            .           .
      yo_482 |   9.247906          .        .       .            .           .
      yo_483 |   15.11128          .        .       .            .           .
      yo_484 |   11.08717          .        .       .            .           .
      yo_485 |   11.23242          .        .       .            .           .
      yo_486 |    8.97843          .        .       .            .           .
      yo_487 |   13.25806          .        .       .            .           .
      yo_488 |   14.55238          .        .       .            .           .
      yo_489 |   14.43548          .        .       .            .           .
      yo_490 |   13.67536          .        .       .            .           .
      yo_491 |   13.64158          .        .       .            .           .
      yo_492 |    12.5973          .        .       .            .           .
      yo_493 |   10.79773          .        .       .            .           .
      yo_494 |   13.22589          .        .       .            .           .
      yo_495 |   15.07884          .        .       .            .           .
      yo_496 |    10.2824          .        .       .            .           .
      yo_497 |   10.85611          .        .       .            .           .
      yo_498 |    16.2304          .        .       .            .           .
      yo_499 |   12.85731          .        .       .            .           .
      yo_500 |   11.19429          .        .       .            .           .
      yo_501 |   9.471235          .        .       .            .           .
      yo_502 |    10.8906          .        .       .            .           .
      yo_503 |   5.158306          .        .       .            .           .
      yo_504 |   7.120475          .        .       .            .           .
      yo_505 |   15.23402          .        .       .            .           .
      yo_506 |   13.25238          .        .       .            .           .
      yo_507 |   9.335661          .        .       .            .           .
      yo_508 |   10.28487          .        .       .            .           .
      yo_509 |   10.19468          .        .       .            .           .
      yo_510 |   13.05132          .        .       .            .           .
      yo_511 |    8.34719          .        .       .            .           .
      yo_512 |   11.77357          .        .       .            .           .
      yo_513 |   9.123731          .        .       .            .           .
      yo_514 |   11.73801          .        .       .            .           .
      yo_515 |   10.44534          .        .       .            .           .
      yo_516 |   11.15601          .        .       .            .           .
      yo_517 |   9.985626          .        .       .            .           .
      yo_518 |   11.91374          .        .       .            .           .
      yo_519 |   9.437477          .        .       .            .           .
      yo_520 |   10.08406          .        .       .            .           .
      yo_521 |   8.176853          .        .       .            .           .
      yo_522 |   14.83271          .        .       .            .           .
      yo_523 |   6.440613          .        .       .            .           .
      yo_524 |   10.07106          .        .       .            .           .
      yo_525 |   8.763083          .        .       .            .           .
      yo_526 |   10.42274          .        .       .            .           .
      yo_527 |   10.91255          .        .       .            .           .
      yo_528 |   9.856992          .        .       .            .           .
      yo_529 |   11.23202          .        .       .            .           .
      yo_530 |   10.02802          .        .       .            .           .
      yo_531 |   10.77298          .        .       .            .           .
      yo_532 |   9.430893          .        .       .            .           .
      yo_533 |   14.68181          .        .       .            .           .
      yo_534 |    10.6173          .        .       .            .           .
      yo_535 |   10.32931          .        .       .            .           .
      yo_536 |   8.842333          .        .       .            .           .
      yo_537 |   13.69611          .        .       .            .           .
      yo_538 |   10.28601          .        .       .            .           .
      yo_539 |   14.67893          .        .       .            .           .
      yo_540 |    13.9879          .        .       .            .           .
      yo_541 |   9.397119          .        .       .            .           .
      yo_542 |   4.600591          .        .       .            .           .
      yo_543 |   13.25887          .        .       .            .           .
      yo_544 |   12.65816          .        .       .            .           .
      yo_545 |   12.35007          .        .       .            .           .
      yo_546 |   11.04281          .        .       .            .           .
      yo_547 |   13.05543          .        .       .            .           .
      yo_548 |   13.78245          .        .       .            .           .
      yo_549 |   7.008828          .        .       .            .           .
      yo_550 |   11.27989          .        .       .            .           .
      yo_551 |   13.60007          .        .       .            .           .
      yo_552 |   9.389062          .        .       .            .           .
      yo_553 |    12.9931          .        .       .            .           .
      yo_554 |   10.78515          .        .       .            .           .
      yo_555 |   9.022379          .        .       .            .           .
      yo_556 |   12.89848          .        .       .            .           .
      yo_557 |   12.65271          .        .       .            .           .
      yo_558 |   15.28876          .        .       .            .           .
      yo_559 |   7.514956          .        .       .            .           .
      yo_560 |   14.84422          .        .       .            .           .
      yo_561 |   11.44742          .        .       .            .           .
      yo_562 |   9.932468          .        .       .            .           .
      yo_563 |   15.16883          .        .       .            .           .
      yo_564 |    6.32949          .        .       .            .           .
      yo_565 |   8.490613          .        .       .            .           .
      yo_566 |   8.122497          .        .       .            .           .
      yo_567 |   10.75188          .        .       .            .           .
      yo_568 |   2.726658          .        .       .            .           .
      yo_569 |   8.593523          .        .       .            .           .
      yo_570 |   5.276786          .        .       .            .           .
      yo_571 |   5.230718          .        .       .            .           .
      yo_572 |   9.998775          .        .       .            .           .
      yo_573 |   12.59217          .        .       .            .           .
      yo_574 |   11.87737          .        .       .            .           .
      yo_575 |   14.09422          .        .       .            .           .
      yo_576 |   9.657109          .        .       .            .           .
      yo_577 |   8.814824          .        .       .            .           .
      yo_578 |   11.82402          .        .       .            .           .
      yo_579 |   10.60297          .        .       .            .           .
      yo_580 |   9.286658          .        .       .            .           .
      yo_581 |   14.58978          .        .       .            .           .
      yo_582 |   10.22627          .        .       .            .           .
      yo_583 |   11.44781          .        .       .            .           .
      yo_585 |   6.260231          .        .       .            .           .
      yo_586 |   12.18954          .        .       .            .           .
      yo_587 |   11.63204          .        .       .            .           .
      yo_588 |   13.78649          .        .       .            .           .
      yo_589 |   3.939064          .        .       .            .           .
      yo_590 |     14.806          .        .       .            .           .
      yo_591 |   10.22204          .        .       .            .           .
      yo_592 |   9.322705          .        .       .            .           .
      yo_593 |   12.91602          .        .       .            .           .
      yo_594 |   11.31821          .        .       .            .           .
      yo_595 |    16.9263          .        .       .            .           .
      yo_596 |   11.28422          .        .       .            .           .
      yo_597 |   7.939077          .        .       .            .           .
      yo_598 |   13.84543          .        .       .            .           .
      yo_599 |   13.12336          .        .       .            .           .
      yo_600 |   8.650149          .        .       .            .           .
      yo_601 |   7.424287          .        .       .            .           .
      yo_602 |   11.57382          .        .       .            .           .
      yo_603 |   8.611572          .        .       .            .           .
      yo_604 |   14.17603          .        .       .            .           .
      yo_605 |   10.36557          .        .       .            .           .
      yo_606 |   11.59798          .        .       .            .           .
      yo_607 |   10.63121          .        .       .            .           .
        yd_1 |   5.160582          .        .       .            .           .
        yd_2 |   5.375686          .        .       .            .           .
        yd_3 |   7.136738          .        .       .            .           .
        yd_4 |   5.258848          .        .       .            .           .
        yd_5 |   1.554383          .        .       .            .           .
        yd_6 |    7.22647          .        .       .            .           .
        yd_7 |   9.009147          .        .       .            .           .
        yd_8 |   8.401536          .        .       .            .           .
        yd_9 |   5.106863          .        .       .            .           .
       yd_10 |   4.693135          .        .       .            .           .
       yd_11 |   10.10585          .        .       .            .           .
       yd_12 |   8.665002          .        .       .            .           .
       yd_13 |   6.140724          .        .       .            .           .
       yd_14 |   3.591479          .        .       .            .           .
       yd_15 |   9.202021          .        .       .            .           .
       yd_16 |   5.618442          .        .       .            .           .
       yd_17 |   4.901535          .        .       .            .           .
       yd_18 |   7.246685          .        .       .            .           .
       yd_19 |   7.130016          .        .       .            .           .
       yd_20 |   6.501466          .        .       .            .           .
       yd_21 |    6.43803          .        .       .            .           .
       yd_22 |   5.878786          .        .       .            .           .
       yd_23 |   7.131594          .        .       .            .           .
       yd_24 |    4.16464          .        .       .            .           .
       yd_25 |   6.210253          .        .       .            .           .
       yd_26 |   5.875487          .        .       .            .           .
       yd_27 |   9.619431          .        .       .            .           .
       yd_28 |   5.332869          .        .       .            .           .
       yd_29 |   5.167114          .        .       .            .           .
       yd_30 |   3.522711          .        .       .            .           .
       yd_31 |   4.671469          .        .       .            .           .
       yd_32 |   3.083481          .        .       .            .           .
       yd_33 |   10.26422          .        .       .            .           .
       yd_34 |   8.669403          .        .       .            .           .
       yd_35 |   8.480367          .        .       .            .           .
       yd_36 |   11.08311          .        .       .            .           .
       yd_37 |   6.618837          .        .       .            .           .
       yd_38 |   5.779054          .        .       .            .           .
       yd_39 |    5.28987          .        .       .            .           .
       yd_40 |   7.847825          .        .       .            .           .
       yd_41 |   3.011991          .        .       .            .           .
       yd_42 |   4.196357          .        .       .            .           .
       yd_43 |   7.157381          .        .       .            .           .
       yd_44 |    6.42994          .        .       .            .           .
       yd_45 |   7.249947          .        .       .            .           .
       yd_46 |   8.205959          .        .       .            .           .
       yd_47 |   10.73467          .        .       .            .           .
       yd_48 |   4.747719          .        .       .            .           .
       yd_49 |   3.434225          .        .       .            .           .
       yd_50 |    8.26358          .        .       .            .           .
       yd_51 |   7.150299          .        .       .            .           .
       yd_52 |   7.484348          .        .       .            .           .
       yd_53 |   7.200887          .        .       .            .           .
       yd_54 |   7.865513          .        .       .            .           .
       yd_55 |   3.988401          .        .       .            .           .
       yd_56 |   10.11011          .        .       .            .           .
       yd_57 |   6.662188          .        .       .            .           .
       yd_58 |   5.916722          .        .       .            .           .
       yd_59 |   8.505936          .        .       .            .           .
       yd_60 |   5.467383          .        .       .            .           .
       yd_61 |   3.417218          .        .       .            .           .
       yd_62 |   10.25934          .        .       .            .           .
       yd_63 |   4.065851          .        .       .            .           .
       yd_64 |   3.122951          .        .       .            .           .
       yd_65 |    5.48948          .        .       .            .           .
       yd_66 |    10.4264          .        .       .            .           .
       yd_67 |   5.463525          .        .       .            .           .
       yd_68 |   6.582055          .        .       .            .           .
       yd_69 |   5.621013          .        .       .            .           .
       yd_70 |   5.229576          .        .       .            .           .
       yd_71 |   4.403673          .        .       .            .           .
       yd_72 |   2.959905          .        .       .            .           .
       yd_73 |   4.773652          .        .       .            .           .
       yd_74 |   8.584749          .        .       .            .           .
       yd_75 |    3.51256          .        .       .            .           .
       yd_76 |   4.300741          .        .       .            .           .
       yd_77 |   7.127999          .        .       .            .           .
       yd_78 |    4.46541          .        .       .            .           .
       yd_79 |   10.03325          .        .       .            .           .
       yd_80 |   6.781939          .        .       .            .           .
       yd_81 |    7.04687          .        .       .            .           .
       yd_82 |     5.3029          .        .       .            .           .
       yd_83 |   8.281684          .        .       .            .           .
       yd_84 |   9.193462          .        .       .            .           .
       yd_85 |   9.234578          .        .       .            .           .
       yd_86 |   8.420573          .        .       .            .           .
       yd_87 |   8.338258          .        .       .            .           .
       yd_88 |   6.888086          .        .       .            .           .
       yd_89 |   6.099127          .        .       .            .           .
       yd_90 |   8.460832          .        .       .            .           .
       yd_91 |   10.24119          .        .       .            .           .
       yd_92 |   6.276185          .        .       .            .           .
       yd_93 |   6.776913          .        .       .            .           .
       yd_94 |   10.97726          .        .       .            .           .
       yd_95 |   7.411762          .        .       .            .           .
       yd_96 |    6.75056          .        .       .            .           .
       yd_97 |   5.133951          .        .       .            .           .
       yd_98 |   5.784912          .        .       .            .           .
       yd_99 |   2.582051          .        .       .            .           .
      yd_100 |   4.059117          .        .       .            .           .
      yd_101 |   9.854251          .        .       .            .           .
      yd_102 |   7.150351          .        .       .            .           .
      yd_103 |   4.491338          .        .       .            .           .
      yd_104 |   6.756619          .        .       .            .           .
      yd_105 |   6.582697          .        .       .            .           .
      yd_106 |   6.699423          .        .       .            .           .
      yd_107 |   3.964723          .        .       .            .           .
      yd_108 |    7.11914          .        .       .            .           .
      yd_109 |   4.328611          .        .       .            .           .
      yd_110 |   6.908392          .        .       .            .           .
      yd_111 |   8.485551          .        .       .            .           .
      yd_112 |   6.509716          .        .       .            .           .
      yd_113 |   5.848897          .        .       .            .           .
      yd_114 |   7.617732          .        .       .            .           .
      yd_115 |   5.402378          .        .       .            .           .
      yd_116 |   5.642165          .        .       .            .           .
      yd_117 |   4.692116          .        .       .            .           .
      yd_118 |   10.11168          .        .       .            .           .
      yd_119 |   5.417858          .        .       .            .           .
      yd_120 |   5.550627          .        .       .            .           .
      yd_121 |   5.182358          .        .       .            .           .
      yd_122 |   6.258597          .        .       .            .           .
      yd_123 |   5.774825          .        .       .            .           .
      yd_124 |   4.687953          .        .       .            .           .
      yd_125 |   6.035435          .        .       .            .           .
      yd_126 |   4.966906          .        .       .            .           .
      yd_127 |   6.268928          .        .       .            .           .
      yd_128 |   4.824407          .        .       .            .           .
      yd_129 |   9.247897          .        .       .            .           .
      yd_130 |   4.788881          .        .       .            .           .
      yd_131 |   5.913233          .        .       .            .           .
      yd_132 |   4.683897          .        .       .            .           .
      yd_133 |   7.822073          .        .       .            .           .
      yd_134 |   5.940508          .        .       .            .           .
      yd_135 |   9.610736          .        .       .            .           .
      yd_136 |    8.31929          .        .       .            .           .
      yd_137 |   5.314674          .        .       .            .           .
      yd_138 |   1.524184          .        .       .            .           .
      yd_139 |   8.598109          .        .       .            .           .
      yd_140 |   6.658064          .        .       .            .           .
      yd_141 |   7.740897          .        .       .            .           .
      yd_142 |   8.031391          .        .       .            .           .
      yd_143 |   7.678744          .        .       .            .           .
      yd_144 |   8.635463          .        .       .            .           .
      yd_145 |   1.792641          .        .       .            .           .
      yd_146 |   5.514127          .        .       .            .           .
      yd_147 |   8.621384          .        .       .            .           .
      yd_148 |   4.986103          .        .       .            .           .
      yd_149 |   8.731523          .        .       .            .           .
      yd_150 |   6.426396          .        .       .            .           .
      yd_151 |   5.952175          .        .       .            .           .
      yd_152 |   6.727139          .        .       .            .           .
      yd_153 |   7.952861          .        .       .            .           .
      yd_154 |   9.368159          .        .       .            .           .
      yd_155 |   3.898795          .        .       .            .           .
      yd_156 |   8.676543          .        .       .            .           .
      yd_157 |   6.480994          .        .       .            .           .
      yd_158 |   6.175772          .        .       .            .           .
      yd_159 |   9.750173          .        .       .            .           .
      yd_160 |   2.685405          .        .       .            .           .
      yd_161 |   3.206284          .        .       .            .           .
      yd_162 |   4.306173          .        .       .            .           .
      yd_163 |   6.837894          .        .       .            .           .
      yd_164 |   1.021431          .        .       .            .           .
      yd_165 |   4.219998          .        .       .            .           .
      yd_166 |   2.575109          .        .       .            .           .
      yd_167 |   2.442816          .        .       .            .           .
      yd_168 |   4.800011          .        .       .            .           .
      yd_169 |   7.432841          .        .       .            .           .
      yd_170 |   6.901468          .        .       .            .           .
      yd_171 |   8.987629          .        .       .            .           .
      yd_172 |   3.745503          .        .       .            .           .
      yd_173 |   4.334522          .        .       .            .           .
      yd_174 |   7.859135          .        .       .            .           .
      yd_175 |   4.086608          .        .       .            .           .
      yd_176 |    5.55017          .        .       .            .           .
      yd_177 |   9.287872          .        .       .            .           .
      yd_178 |   4.880976          .        .       .            .           .
      yd_179 |    5.75283          .        .       .            .           .
      yd_181 |   3.233972          .        .       .            .           .
      yd_182 |   6.582325          .        .       .            .           .
      yd_183 |    7.06354          .        .       .            .           .
      yd_184 |   9.230111          .        .       .            .           .
      yd_185 |   2.170229          .        .       .            .           .
      yd_186 |   9.647633          .        .       .            .           .
      yd_187 |   6.129784          .        .       .            .           .
      yd_188 |   5.377325          .        .       .            .           .
      yd_189 |   7.993563          .        .       .            .           .
      yd_190 |   6.570607          .        .       .            .           .
      yd_191 |   12.59649          .        .       .            .           .
      yd_192 |   5.957041          .        .       .            .           .
      yd_193 |    4.44169          .        .       .            .           .
      yd_194 |   7.900651          .        .       .            .           .
      yd_195 |   8.051704          .        .       .            .           .
      yd_196 |   3.719354          .        .       .            .           .
      yd_197 |   3.994392          .        .       .            .           .
      yd_198 |   6.532775          .        .       .            .           .
      yd_199 |   6.453168          .        .       .            .           .
      yd_200 |   9.269689          .        .       .            .           .
      yd_201 |   5.428376          .        .       .            .           .
      yd_202 |   5.861656          .        .       .            .           .
      yd_203 |    5.81762          .        .       .            .           .
      yd_204 |   3.571652          .        .       .            .           .
      yd_205 |   3.888585          .        .       .            .           .
      yd_206 |   5.389639          .        .       .            .           .
      yd_207 |    3.52049          .        .       .            .           .
      yd_209 |   5.517507          .        .       .            .           .
      yd_210 |   7.374612          .        .       .            .           .
      yd_211 |   6.744546          .        .       .            .           .
      yd_212 |   3.429285          .        .       .            .           .
      yd_213 |   3.225815          .        .       .            .           .
      yd_214 |   8.353801          .        .       .            .           .
      yd_215 |    6.86534          .        .       .            .           .
      yd_216 |   4.460432          .        .       .            .           .
      yd_217 |   1.944685          .        .       .            .           .
      yd_218 |   7.460223          .        .       .            .           .
      yd_219 |   4.033534          .        .       .            .           .
      yd_220 |   3.079469          .        .       .            .           .
      yd_221 |   5.511587          .        .       .            .           .
      yd_222 |   5.476084          .        .       .            .           .
      yd_223 |   4.779734          .        .       .            .           .
      yd_224 |   5.083963          .        .       .            .           .
      yd_225 |   4.180433          .        .       .            .           .
      yd_226 |   5.285234          .        .       .            .           .
      yd_227 |   2.635648          .        .       .            .           .
      yd_228 |   4.217482          .        .       .            .           .
      yd_229 |   4.194034          .        .       .            .           .
      yd_230 |   7.891438          .        .       .            .           .
      yd_231 |   3.558701          .        .       .            .           .
      yd_232 |   3.296898          .        .       .            .           .
      yd_233 |   1.102148          .        .       .            .           .
      yd_234 |   2.861122          .        .       .            .           .
      yd_235 |   1.280764          .        .       .            .           .
      yd_236 |   8.555543          .        .       .            .           .
      yd_237 |    6.91368          .        .       .            .           .
      yd_238 |   6.941477          .        .       .            .           .
      yd_239 |   9.364509          .        .       .            .           .
      yd_240 |   4.939282          .        .       .            .           .
      yd_241 |   4.021065          .        .       .            .           .
      yd_242 |   3.634744          .        .       .            .           .
      yd_243 |   6.191751          .        .       .            .           .
      yd_244 |   1.144268          .        .       .            .           .
      yd_245 |   2.405324          .        .       .            .           .
      yd_246 |   5.420614          .        .       .            .           .
      yd_247 |   4.893918          .        .       .            .           .
      yd_248 |   5.355647          .        .       .            .           .
      yd_249 |   6.476299          .        .       .            .           .
      yd_250 |   8.945425          .        .       .            .           .
      yd_251 |   3.144576          .        .       .            .           .
      yd_252 |   1.700338          .        .       .            .           .
      yd_253 |   6.531226          .        .       .            .           .
      yd_254 |   5.434036          .        .       .            .           .
      yd_255 |   5.733502          .        .       .            .           .
      yd_256 |   5.556517          .        .       .            .           .
      yd_257 |   6.142573          .        .       .            .           .
      yd_258 |   2.011602          .        .       .            .           .
      yd_259 |   8.367627          .        .       .            .           .
      yd_260 |   4.997144          .        .       .            .           .
      yd_261 |   4.376261          .        .       .            .           .
      yd_262 |   6.755061          .        .       .            .           .
      yd_263 |   3.750295          .        .       .            .           .
      yd_264 |   1.384984          .        .       .            .           .
      yd_265 |   8.479451          .        .       .            .           .
      yd_266 |   2.321097          .        .       .            .           .
      yd_267 |   .6253728          .        .       .            .           .
      yd_268 |   3.638892          .        .       .            .           .
      yd_269 |   8.604276          .        .       .            .           .
      yd_270 |   3.773056          .        .       .            .           .
      yd_271 |   4.820688          .        .       .            .           .
      yd_272 |   4.014068          .        .       .            .           .
      yd_273 |   3.404511          .        .       .            .           .
      yd_274 |   2.623493          .        .       .            .           .
      yd_275 |    1.57026          .        .       .            .           .
      yd_276 |   3.307501          .        .       .            .           .
      yd_277 |   6.737004          .        .       .            .           .
      yd_278 |   1.850366          .        .       .            .           .
      yd_279 |   2.615826          .        .       .            .           .
      yd_280 |   5.417184          .        .       .            .           .
      yd_281 |   2.745497          .        .       .            .           .
      yd_282 |   8.218463          .        .       .            .           .
      yd_283 |   4.921883          .        .       .            .           .
      yd_284 |   5.312732          .        .       .            .           .
      yd_285 |   3.488193          .        .       .            .           .
      yd_286 |   6.557758          .        .       .            .           .
      yd_287 |   7.449822          .        .       .            .           .
      yd_288 |   7.592964          .        .       .            .           .
      yd_289 |   6.689293          .        .       .            .           .
      yd_290 |   6.560282          .        .       .            .           .
      yd_291 |   5.210103          .        .       .            .           .
      yd_292 |   4.514468          .        .       .            .           .
      yd_293 |   6.670696          .        .       .            .           .
      yd_294 |   8.453106          .        .       .            .           .
      yd_295 |    4.59317          .        .       .            .           .
      yd_296 |   5.019854          .        .       .            .           .
      yd_297 |   9.195448          .        .       .            .           .
      yd_298 |   5.734264          .        .       .            .           .
      yd_299 |   5.020739          .        .       .            .           .
      yd_300 |    3.55941          .        .       .            .           .
      yd_301 |   4.100299          .        .       .            .           .
      yd_302 |   .9656393          .        .       .            .           .
      yd_303 |   1.876109          .        .       .            .           .
      yd_304 |   8.116107          .        .       .            .           .
      yd_305 |   5.408251          .        .       .            .           .
      yd_306 |   2.775711          .        .       .            .           .
      yd_307 |   4.924327          .        .       .            .           .
      yd_308 |   4.857087          .        .       .            .           .
      yd_309 |   4.886276          .        .       .            .           .
      yd_310 |   2.649688          .        .       .            .           .
      yd_311 |   5.362705          .        .       .            .           .
      yd_312 |   2.325426          .        .       .            .           .
      yd_313 |   5.178842          .        .       .            .           .
      yd_314 |    5.98244          .        .       .            .           .
      yd_315 |   4.771185          .        .       .            .           .
      yd_316 |   4.047306          .        .       .            .           .
      yd_317 |   5.996511          .        .       .            .           .
      yd_318 |   3.684109          .        .       .            .           .
      yd_319 |   3.815432          .        .       .            .           .
      yd_320 |     2.9207          .        .       .            .           .
      yd_321 |   8.372126          .        .       .            .           .
      yd_322 |   3.944792          .        .       .            .           .
      yd_323 |   3.795687          .        .       .            .           .
      yd_324 |   3.397591          .        .       .            .           .
      yd_325 |   4.354729          .        .       .            .           .
      yd_326 |   3.905261          .        .       .            .           .
      yd_327 |   2.931302          .        .       .            .           .
      yd_328 |   4.343472          .        .       .            .           .
      yd_329 |   3.288596          .        .       .            .           .
      yd_330 |   4.537797          .        .       .            .           .
      yd_331 |   2.903337          .        .       .            .           .
      yd_332 |   7.432024          .        .       .            .           .
      yd_333 |   3.078598          .        .       .            .           .
      yd_334 |   4.002746          .        .       .            .           .
      yd_335 |   2.797203          .        .       .            .           .
      yd_336 |   6.105333          .        .       .            .           .
      yd_337 |   4.191391          .        .       .            .           .
      yd_338 |   7.888918          .        .       .            .           .
      yd_339 |   6.573618          .        .       .            .           .
      yd_340 |    3.51518          .        .       .            .           .
      yd_341 |   -.000164          .        .       .            .           .
      yd_342 |   6.830475          .        .       .            .           .
      yd_343 |     4.9482          .        .       .            .           .
      yd_344 |   6.086494          .        .       .            .           .
      yd_345 |   6.313618          .        .       .            .           .
      yd_346 |   5.877558          .        .       .            .           .
      yd_347 |    6.81216          .        .       .            .           .
      yd_348 |  -.0549916          .        .       .            .           .
      yd_349 |   3.859694          .        .       .            .           .
      yd_350 |   6.863035          .        .       .            .           .
      yd_351 |   3.145181          .        .       .            .           .
      yd_352 |   6.937321          .        .       .            .           .
      yd_353 |   4.740302          .        .       .            .           .
      yd_354 |    4.35955          .        .       .            .           .
      yd_355 |   4.964858          .        .       .            .           .
      yd_356 |   6.295758          .        .       .            .           .
      yd_357 |   7.723359          .        .       .            .           .
      yd_358 |   2.161611          .        .       .            .           .
      yd_359 |   6.984954          .        .       .            .           .
      yd_360 |   5.017585          .        .       .            .           .
      yd_361 |   4.505847          .        .       .            .           .
      yd_362 |   8.006012          .        .       .            .           .
      yd_363 |   1.023725          .        .       .            .           .
      yd_364 |   1.624304          .        .       .            .           .
      yd_365 |    2.57906          .        .       .            .           .
      yd_366 |   5.016672          .        .       .            .           .
      yd_367 |  -1.879293          .        .       .            .           .
      yd_368 |   2.452786          .        .       .            .           .
      yd_369 |    .278869          .        .       .            .           .
      yd_370 |   .5547541          .        .       .            .           .
      yd_371 |   3.113197          .        .       .            .           .
      yd_372 |   5.785659          .        .       .            .           .
      yd_373 |   5.173373          .        .       .            .           .
      yd_374 |   7.211272          .        .       .            .           .
      yd_375 |   1.746851          .        .       .            .           .
      yd_376 |   2.784751          .        .       .            .           .
      yd_377 |   5.453082          .        .       .            .           .
      yd_378 |   2.361406          .        .       .            .           .
      yd_379 |   3.832665          .        .       .            .           .
      yd_380 |    7.60634          .        .       .            .           .
      yd_381 |    3.22436          .        .       .            .           .
      yd_382 |   3.840246          .        .       .            .           .
      yd_383 |  -2.701566          .        .       .            .           .
      yd_384 |   1.406914          .        .       .            .           .
      yd_385 |   4.764345          .        .       .            .           .
      yd_386 |   5.232441          .        .       .            .           .
      yd_387 |   7.507322          .        .       .            .           .
      yd_388 |   .8053098          .        .       .            .           .
      yd_389 |   7.831331          .        .       .            .           .
      yd_390 |   4.394394          .        .       .            .           .
      yd_391 |   3.611919          .        .       .            .           .
      yd_392 |   6.335286          .        .       .            .           .
      yd_393 |   4.880434          .        .       .            .           .
      yd_394 |    10.8287          .        .       .            .           .
      yd_395 |   4.184069          .        .       .            .           .
      yd_396 |   2.805013          .        .       .            .           .
      yd_397 |   6.333567          .        .       .            .           .
      yd_398 |   6.283013          .        .       .            .           .
      yd_399 |   2.012213          .        .       .            .           .
      yd_400 |   3.046662          .        .       .            .           .
      yd_401 |   4.751505          .        .       .            .           .
      yd_402 |   4.273693          .        .       .            .           .
      yd_403 |   7.523282          .        .       .            .           .
      yd_404 |   3.690035          .        .       .            .           .
      yd_405 |    4.13877          .        .       .            .           .
      yd_406 |   4.287053          .        .       .            .           .
      yd_407 |   3.648677          .        .       .            .           .
      yd_408 |   4.308067          .        .       .            .           .
      yd_409 |   5.899062          .        .       .            .           .
      yd_410 |   3.750376          .        .       .            .           .
      yd_411 |  -.1345172          .        .       .            .           .
      yd_412 |   5.998257          .        .       .            .           .
      yd_413 |   7.684302          .        .       .            .           .
      yd_414 |   7.106486          .        .       .            .           .
      yd_415 |   3.637372          .        .       .            .           .
      yd_416 |   3.637041          .        .       .            .           .
      yd_417 |   8.650747          .        .       .            .           .
      yd_418 |   7.199374          .        .       .            .           .
      yd_419 |   4.904651          .        .       .            .           .
      yd_420 |   2.547273          .        .       .            .           .
      yd_421 |   7.784108          .        .       .            .           .
      yd_422 |    4.50978          .        .       .            .           .
      yd_423 |   3.409874          .        .       .            .           .
      yd_424 |   5.843982          .        .       .            .           .
      yd_425 |   5.907262          .        .       .            .           .
      yd_426 |   5.164761          .        .       .            .           .
      yd_427 |   5.384876          .        .       .            .           .
      yd_428 |   4.423105          .        .       .            .           .
      yd_429 |   5.769308          .        .       .            .           .
      yd_430 |   2.801385          .        .       .            .           .
      yd_431 |   4.667937          .        .       .            .           .
      yd_432 |   4.369898          .        .       .            .           .
      yd_433 |   8.310494          .        .       .            .           .
      yd_434 |   3.789373          .        .       .            .           .
      yd_435 |   3.676074          .        .       .            .           .
      yd_436 |   1.365008          .        .       .            .           .
      yd_437 |   3.113271          .        .       .            .           .
      yd_438 |   1.793443          .        .       .            .           .
      yd_439 |   8.873889          .        .       .            .           .
      yd_440 |   7.250121          .        .       .            .           .
      yd_441 |   7.255563          .        .       .            .           .
      yd_442 |   9.749738          .        .       .            .           .
      yd_443 |   5.112279          .        .       .            .           .
      yd_444 |   4.356252          .        .       .            .           .
      yd_445 |   4.045232          .        .       .            .           .
      yd_446 |   6.573345          .        .       .            .           .
      yd_447 |   1.563509          .        .       .            .           .
      yd_448 |   2.854251          .        .       .            .           .
      yd_449 |   5.707868          .        .       .            .           .
      yd_450 |   5.387298          .        .       .            .           .
      yd_451 |   5.667371          .        .       .            .           .
      yd_452 |   6.830446          .        .       .            .           .
      yd_453 |   9.246786          .        .       .            .           .
      yd_454 |   3.591258          .        .       .            .           .
      yd_455 |   2.011853          .        .       .            .           .
      yd_456 |   6.856962          .        .       .            .           .
      yd_457 |   5.781788          .        .       .            .           .
      yd_458 |   6.004934          .        .       .            .           .
      yd_459 |   5.921102          .        .       .            .           .
      yd_460 |   6.512798          .        .       .            .           .
      yd_461 |   2.111086          .        .       .            .           .
      yd_462 |   8.693648          .        .       .            .           .
      yd_463 |   5.462671          .        .       .            .           .
      yd_464 |    4.46982          .        .       .            .           .
      yd_465 |   7.100899          .        .       .            .           .
      yd_466 |   4.041526          .        .       .            .           .
      yd_467 |   1.658397          .        .       .            .           .
      yd_468 |   8.764678          .        .       .            .           .
      yd_469 |    2.56101          .        .       .            .           .
      yd_470 |   .6760117          .        .       .            .           .
      yd_471 |   3.958811          .        .       .            .           .
      yd_472 |   8.924885          .        .       .            .           .
      yd_473 |   4.311987          .        .       .            .           .
      yd_474 |   5.152523          .        .       .            .           .
      yd_475 |   4.614776          .        .       .            .           .
      yd_476 |   3.684948          .        .       .            .           .
      yd_477 |   2.928459          .        .       .            .           .
      yd_478 |   1.677096          .        .       .            .           .
      yd_479 |   3.871109          .        .       .            .           .
      yd_480 |   7.047201          .        .       .            .           .
      yd_481 |   2.061738          .        .       .            .           .
      yd_482 |   2.795124          .        .       .            .           .
      yd_483 |   5.612143          .        .       .            .           .
      yd_484 |   3.197014          .        .       .            .           .
      yd_485 |   8.533802          .        .       .            .           .
      yd_486 |   5.266469          .        .       .            .           .
      yd_487 |   5.655206          .        .       .            .           .
      yd_488 |   3.917346          .        .       .            .           .
      yd_489 |   6.916403          .        .       .            .           .
      yd_490 |   7.683483          .        .       .            .           .
      yd_491 |   7.935877          .        .       .            .           .
      yd_492 |   6.962727          .        .       .            .           .
      yd_493 |   6.812952          .        .       .            .           .
      yd_494 |   5.458994          .        .       .            .           .
      yd_495 |   4.911633          .        .       .            .           .
      yd_496 |   6.936084          .        .       .            .           .
      yd_497 |   8.795611          .        .       .            .           .
      yd_498 |    4.93078          .        .       .            .           .
      yd_499 |   5.321702          .        .       .            .           .
      yd_500 |   9.485528          .        .       .            .           .
      yd_501 |   6.208245          .        .       .            .           .
      yd_502 |   5.400154          .        .       .            .           .
      yd_503 |   4.338346          .        .       .            .           .
      yd_504 |   4.395954          .        .       .            .           .
      yd_505 |    1.01985          .        .       .            .           .
      yd_506 |   2.331327          .        .       .            .           .
      yd_507 |   8.450459          .        .       .            .           .
      yd_508 |   5.663305          .        .       .            .           .
      yd_509 |   3.213458          .        .       .            .           .
      yd_510 |   5.236632          .        .       .            .           .
      yd_511 |   5.269499          .        .       .            .           .
      yd_512 |   5.237758          .        .       .            .           .
      yd_513 |   3.021028          .        .       .            .           .
      yd_514 |   5.685245          .        .       .            .           .
      yd_515 |   2.665673          .        .       .            .           .
      yd_516 |   5.589998          .        .       .            .           .
      yd_517 |   6.223516          .        .       .            .           .
      yd_518 |   5.240345          .        .       .            .           .
      yd_519 |   4.435921          .        .       .            .           .
      yd_520 |   6.141672          .        .       .            .           .
      yd_521 |   4.031077          .        .       .            .           .
      yd_522 |     4.0632          .        .       .            .           .
      yd_523 |   3.230009          .        .       .            .           .
      yd_524 |   8.730659          .        .       .            .           .
      yd_525 |   4.834222          .        .       .            .           .
      yd_526 |   4.166062          .        .       .            .           .
      yd_527 |     3.7376          .        .       .            .           .
      yd_528 |   4.792168          .        .       .            .           .
      yd_529 |   4.165091          .        .       .            .           .
      yd_530 |    3.39031          .        .       .            .           .
      yd_531 |   4.563316          .        .       .            .           .
      yd_532 |   3.546501          .        .       .            .           .
      yd_533 |   4.792403          .        .       .            .           .
      yd_534 |    3.16928          .        .       .            .           .
      yd_535 |    7.74769          .        .       .            .           .
      yd_536 |   3.467058          .        .       .            .           .
      yd_537 |   4.314834          .        .       .            .           .
      yd_538 |   3.170858          .        .       .            .           .
      yd_539 |   6.476381          .        .       .            .           .
      yd_540 |   4.593516          .        .       .            .           .
      yd_541 |   8.261234          .        .       .            .           .
      yd_542 |   6.916376          .        .       .            .           .
      yd_543 |   3.795293          .        .       .            .           .
      yd_544 |   .6322172          .        .       .            .           .
      yd_545 |   7.033402          .        .       .            .           .
      yd_546 |   5.304954          .        .       .            .           .
      yd_547 |   6.409509          .        .       .            .           .
      yd_548 |   6.659606          .        .       .            .           .
      yd_549 |   6.294262          .        .       .            .           .
      yd_550 |   7.073435          .        .       .            .           .
      yd_551 |   .3665383          .        .       .            .           .
      yd_552 |   4.209554          .        .       .            .           .
      yd_553 |   7.336109          .        .       .            .           .
      yd_554 |   3.402368          .        .       .            .           .
      yd_555 |   7.195344          .        .       .            .           .
      yd_556 |    5.30372          .        .       .            .           .
      yd_557 |   4.396154          .        .       .            .           .
      yd_558 |   5.544065          .        .       .            .           .
      yd_559 |   6.800371          .        .       .            .           .
      yd_560 |   8.159392          .        .       .            .           .
      yd_561 |   2.516088          .        .       .            .           .
      yd_562 |   7.271433          .        .       .            .           .
      yd_563 |   5.303516          .        .       .            .           .
      yd_564 |   4.692816          .        .       .            .           .
      yd_565 |   8.364429          .        .       .            .           .
      yd_566 |   1.602248          .        .       .            .           .
      yd_567 |   2.047988          .        .       .            .           .
      yd_568 |   2.676273          .        .       .            .           .
      yd_569 |   5.248815          .        .       .            .           .
      yd_570 |  -1.472188          .        .       .            .           .
      yd_571 |   2.887266          .        .       .            .           .
      yd_572 |   .5082053          .        .       .            .           .
      yd_573 |   .9641365          .        .       .            .           .
      yd_574 |   3.363722          .        .       .            .           .
      yd_575 |   6.249391          .        .       .            .           .
      yd_576 |   5.539695          .        .       .            .           .
      yd_577 |   7.542411          .        .       .            .           .
      yd_578 |   2.054528          .        .       .            .           .
      yd_579 |   3.047329          .        .       .            .           .
      yd_580 |   5.811823          .        .       .            .           .
      yd_581 |   2.636271          .        .       .            .           .
      yd_582 |   4.325848          .        .       .            .           .
      yd_583 |   7.908538          .        .       .            .           .
      yd_584 |   3.699286          .        .       .            .           .
      yd_585 |   4.055967          .        .       .            .           .
      yd_586 |  -6.151872          .        .       .            .           .
      yd_587 |   1.688013          .        .       .            .           .
      yd_588 |   5.037292          .        .       .            .           .
      yd_589 |   5.516168          .        .       .            .           .
      yd_590 |   7.866721          .        .       .            .           .
      yd_591 |   1.397228          .        .       .            .           .
      yd_592 |   8.116177          .        .       .            .           .
      yd_593 |   4.802172          .        .       .            .           .
      yd_594 |   4.026385          .        .       .            .           .
      yd_595 |   6.787081          .        .       .            .           .
      yd_596 |   5.278019          .        .       .            .           .
      yd_597 |   11.12797          .        .       .            .           .
      yd_598 |   4.568506          .        .       .            .           .
      yd_599 |   2.788078          .        .       .            .           .
      yd_600 |   6.895951          .        .       .            .           .
      yd_601 |   6.627029          .        .       .            .           .
      yd_602 |   2.217904          .        .       .            .           .
      yd_603 |    2.50431          .        .       .            .           .
      yd_604 |   5.044203          .        .       .            .           .
      yd_605 |   3.640046          .        .       .            .           .
      yd_606 |   7.924107          .        .       .            .           .
      yd_607 |   4.182687          .        .       .            .           .
      yd_608 |   4.534887          .        .       .            .           .
      yd_609 |   4.471005          .        .       .            .           .
       _cons |  -7.245644          .        .       .            .           .
------------------------------------------------------------------------------
(est4 stored)

. eststo: quietly reghdfe logflow_1 logdist contig comlang_off, a(year_iso_o year_iso_d)
(est5 stored)

. timer off 4

. timer list 4
   4:   1456.17 /        1 =    1456.1700

. estadd loca time = r(t4), replace

added macro:
               e(time) : "1456.17"

. estadd local zeros "Yes"

added macro:
              e(zeros) : "Yes"

. estadd local log_plus "No"

added macro:
           e(log_plus) : "No"

. estadd local regtype "PPML"

added macro:
            e(regtype) : "PPML"

. 
. 
. * 5. An estimate of the same constant-elasticity specification that uses the poi2hdfe command to implement the PPML estimator.
. timer on 5

. eststo: quietly poi2hdfe flow logdist contig comlang_off, id1(year_iso_o) id2(year_iso_d)
(est6 stored)

. timer off 5

. timer list 5
   5:     34.02 /        1 =      34.0250

. estadd loca time = r(t5), replace

added macro:
               e(time) : "34.025"

. estadd local zeros "Yes"

added macro:
              e(zeros) : "Yes"

. estadd local log_plus "No"

added macro:
           e(log_plus) : "No"

. estadd local regtype "PPML"

added macro:
            e(regtype) : "PPML"

. 
. * 6. An estimate of the same constant-elasticity specification that uses the ppml_panel_sg command to implement the PPML estimato
> r.
. timer on 6

. eststo: ppml_panel_sg flow logdist contig comlang_off, exporter(iso_o) importer(iso_d) year(year) nopair olsguess nocheck
Initializing...
Iterating...

---------------------------
    Variable |   active    
-------------+-------------
     logdist | -.89896075  
      contig |   .4620756  
 comlang_off |  .21232735  
---------------------------
iterations: 133
tolerance: 1.000e-12
Computing standard errors

 ******* PPML Panel Structural Gravity Estimation ********** 

                                                Number of obs     =     91,685
Log likelihood = -7317860.1                     R-squared         =     0.9067
------------------------------------------------------------------------------
        flow |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     logdist |  -.8989607   .0157116   -57.22   0.000     -.929755   -.8681665
      contig |   .4620756   .0377214    12.25   0.000      .388143    .5360083
 comlang_off |   .2123274    .035796     5.93   0.000     .1421684    .2824863
------------------------------------------------------------------------------
Fixed Effects included: iso_o-year, iso_d-year
Robust standard errors (default)
1 obs. dropped because they belong to groups with all zeros or missing values

(est7 stored)

. timer off 6

. timer list 6
   6:    299.68 /        1 =     299.6820

. estadd loca time = r(t6), replace

added macro:
               e(time) : "299.682"

. estadd local zeros "Yes"

added macro:
              e(zeros) : "Yes"

. estadd local log_plus "No"

added macro:
           e(log_plus) : "No"

. estadd local regtype "PPML"

added macro:
            e(regtype) : "PPML"

. 
. * 7. An estimate of the same constant-elasticity specification that uses the ppmlhdfe command to implement the PPML estimator.
. timer on 7

. eststo: quietly ppmlhdfe flow logdist contig comlang_off, a(year_iso_o year_iso_d)
(est8 stored)

. timer off 7

. timer list 7
   7:      7.53 /        1 =       7.5270

. estadd loca time = r(t7), replace

added macro:
               e(time) : "7.527"

. estadd local zeros "Yes"

added macro:
              e(zeros) : "Yes"

. estadd local log_plus "No"

added macro:
           e(log_plus) : "No"

. estadd local regtype "PPML"

added macro:
            e(regtype) : "PPML"

. 
. * 8. An estimate of the same constant-elasticity specification that uses the ppmlhdfe command to implement the PPML estimator. Om
> it observations in which flow equals zero.
. timer on 8

. eststo: quietly ppmlhdfe flow logdist contig comlang_off if (flow > 0), a(year_iso_o year_iso_d)
(est9 stored)

. timer off 8

. timer list 8
   8:      3.67 /        1 =       3.6690

. estadd loca time = r(t8), replace

added macro:
               e(time) : "3.669"

. estadd local zeros "No"

added macro:
              e(zeros) : "No"

. estadd local log_plus "No"

added macro:
           e(log_plus) : "No"

. estadd local regtype "PPML"

added macro:
            e(regtype) : "PPML"

. 
. 
. esttab using "Table_2.tex", tex label se title(Table 2) ///
>         mgroups("reghdfe" "reghdfe" "reghdfe" "ppml" "poi2hdfe" "ppml_panel_sg" "ppmlhdfe" "ppmlhdfe", ///
>         pattern(1 1 1 1 1 1 1 1) prefix(\multicolumn{@span}{c}{) suffix(})) ///
>         keep(logdist contig comlang_off) ///
>         s(N r2 r2_a zeros log_plus regtype time, label("N" "R^2" "Adj. R2" "Include zero flows?" "log(flows+1)?" "Approach" "Time
>  (sec)")) replace
(output written to Table_2.tex)

. 
.         
. * Breusch-Pagan test
. quietly reg logflow logdist contig comlang_off i.year_iso_o i.year_iso_d if (flow > 0)

. hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of logflow

         chi2(1)      =  8415.97
         Prob > chi2  =   0.0000

. 
. * Residual scatterplot
. scatter resid fitted, graphregion(color(white)) msize(.3) mcolor(blue)

. graph export residuals.png, replace
(file /Users/chaseabram/UChiGit/Dingel Fall 2020/Assignment 2/residuals.png written in PNG format)

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
end of do-file

. do "/Users/chaseabram/UChiGit/Dingel Fall 2020/Assignment 2/Stata_est_1.do"

. * Start log
. capture log close
